#+TITLE: Algebra
#+AUTHOR: Vittorio Zaccaria
#+LEVEL: 3
#+OPTIONS: H:3
#+BEAMER_HEADER: \usepackage{tikz-cd}
#+BEAMER_HEADER: \usepackage{libertine-type1}
#+BEAMER_HEADER: \usepackage{biolinum-type1}
#+BEAMER_HEADER: \usepackage[libertine]{newtxmath}
#+BEAMER_HEADER: \usepackage{amssymb,amsmath}

#+BEAMER_HEADER: \usepackage[T1]{fontenc}
#+BEAMER_HEADER: \usepackage{inconsolata}
#+BEAMER_HEADER: \newcommand{\kk}{\mathbb{k}}
#+BEAMER_HEADER: \newcommand{\KK}{\mathbb{K}}
#+BEAMER_HEADER: \newcommand{\CC}{\mathbb{C}}
#+BEAMER_HEADER: \newcommand{\BB}{\mathbb{B}}
#+BEAMER_HEADER: \newcommand{\NN}{\mathbb{N}}
#+BEAMER_HEADER: \newcommand{\RR}{\mathbb{R}}
#+BEAMER_HEADER: \newcommand{\np}[2]{\langle #1, #2 \rangle}
#+BEAMER_HEADER: \newcommand{\ang}[1]{\langle #1 \rangle}
#+BEAMER_HEADER: \newcommand{\ds}{d^*}
#+BEAMER_HEADER: \newcommand{\es}{e^*}
#+BEAMER_HEADER: \newcommand{\fs}{f^*}
#+BEAMER_HEADER: \newcommand{\ladjof}{\dashv}
#+BEAMER_HEADER: \newcommand{\radjof}{\vdash}
#+STARTUP: indent 

*** Monads from adjoint functors 
:PROPERTIES:
:BEAMER_opt: fragile
:END:
:LOGBOOK:
CLOCK: [2018-07-26 Thu 11:19]--[2018-07-26 Thu 11:24] =>  0:05
:END:
#+BEGIN_EXPORT latex
\begin{tikzcd}
D~\textrm{with}~\epsilon: LR \rightarrow I_d \arrow[rr, "R(\textrm{ight})", bend right=49] & \bot & C~\textrm{with}~\eta: I_c \rightarrow R L \arrow[ll, "L(\textrm{eft})", bend right=49]
\end{tikzcd}
#+END_EXPORT
    - A monad is the shadow cast by an adjunction into the domain of the left-adjoint $C$.
    - It raises from natural transformations that one can build on the base functor $T=RL$.
    - The adjunction ensures that $\mu: RLRL \rightarrow RL$ is natural.
*** Monads from adjoint functors (Maybe monad)
:PROPERTIES:
:BEAMER_opt: fragile
:END:
:LOGBOOK:
CLOCK: [2018-07-26 Thu 11:19]--[2018-07-26 Thu 11:24] =>  0:05
:END:
#+BEGIN_EXPORT latex
\begin{tikzcd}
Set_{*} \arrow[rr, "R(\textrm{ight})~\textrm{forgetful}", bend right=49] & \bot & Set  \arrow[ll, "L(\textrm{eft}) ~ \textrm{free}", bend right=49]
\end{tikzcd}
#+END_EXPORT

- The left-adjoint is *free* and takes each set $S$ (in $Set$) to the pair $(S \cup \{\nu_S\}, \nu_S)$. 
  while morphisms $f: A \rightarrow B$ are mapped to point preserving functions $Lf (\nu_A) = \nu_B$
- The right-adjoint just returns $S \cup \{\nu_S\}$
- $\eta = LR$ adds a new basepoint to the set and the natural transformation is given
  by natural inclusion.
- $\mu = LRLR$ map the two new points (because we have to LR in series) to a single
  given by $LR$.

*** Adjoint functors 
:PROPERTIES:
:BEAMER_opt: fragile
:END:
:LOGBOOK:
CLOCK: [2018-07-26 Thu 11:19]--[2018-07-26 Thu 11:24] =>  0:05
:END:
#+BEGIN_EXPORT latex
\begin{tikzcd}
D~\textrm{with}~\epsilon: LR \rightarrow I_d \arrow[rr, "R(\textrm{ight})", bend right=49] & \bot & C~\textrm{with}~\eta: I_c \rightarrow R L \arrow[ll, "L(\textrm{eft})", bend right=49]
\end{tikzcd}
#+END_EXPORT
    - Two categories $C$ and $D$ are equivalent if I can build two functors, one
      going left $L: D \leftarrow C$ and $R: D \rightarrow C$ if their
      composition is naturally isomorphic through $\eta$ and $\epsilon$ 
    - We say that $L$ is /left adjoint/ to R
